//=============================================================================
//
// コンパス処理 [compass.h]
// Author : 鶴間俊樹
//
//=============================================================================
#ifndef _COMPASS_H_
#define _COMPASS_H_

#include "main.h"
#include "scene2D.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
//前方宣言
//*****************************************************************************

//*****************************************************************************
// タイマークラス
//*****************************************************************************
class CCompass : public CScene
{
public:
	CCompass();	//デフォルトコンストラクタ
	~CCompass();	//デストラクタ
	static CCompass* Create(void);	//生成処理
	HRESULT Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	void Update(void);	//更新処理
	void Draw(void);	//描画処理

private:
	CScene2D* m_pDial;	//コンパスの目盛りのポインタ
	CScene2D* m_pMark;	//指し示すもののマークのポインタ
};

#endif // !_COMPASS_H_