//=============================================================================
//
// リンゴアイテムの処理 [item_apple.h]
// Author : 鶴間俊樹
//
//=============================================================================
#ifndef _ITEM_APPLE_H_
#define _ITEM_APPLE_H_

#include "item.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// リンゴアイテムクラス
//*****************************************************************************
class CItemApple : public CItem
{
public:

	CItemApple();	//デフォルトコンストラクタ
	CItemApple(D3DXVECTOR3 pos);	//オーバーロードされたコンストラクタ
	~CItemApple();	//デストラクタ
	static CItemApple* Create(D3DXVECTOR3 pos);	//生成処理
	HRESULT Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	void Update(void);	//更新処理
	void Draw(void);	//描画処理
	float GetRadius(void);			//当たり判定の半径の取得
	void CollisionObject(CScene* pScene);	//アイテムがオブジェクトと衝突したときの処理

private:

};

#endif // !_ITEM_APPLE_H_