//=============================================================================
//
// オブジェクトリスト処理 [objectList.h]
// Author : 鶴間俊樹
//
//=============================================================================
#ifndef _OBJECT_LIST_H_
#define _OBJECT_LIST_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene;

//*****************************************************************************
// オブジェクトリストクラス
//*****************************************************************************
class CObjectList
{
public:
	CObjectList();	//デフォルトコンストラクタ
	~CObjectList();	//デストラクタ
	void Init(void);	//初期化処理
	void AppendNode(CScene* pScene);	//ノードの追加
	bool DeleteNode(CScene* pScene);	//ノードの削除
	bool MatchObject(CScene* pScene);	//一致するオブジェクトがあるかどうか

private:
	//リストのノード
	struct ListNode
	{
		CScene* pScene;			//オブジェクトのポインタ
		ListNode* pNextNode;	//次のノード
	};

	ListNode* m_pTopNode;	//先頭のノード
};

#endif // !_OBJECT_LIST_H_