//=============================================================================
//
// ポーズ処理 [pause.h]
// Author : 鶴間俊樹
//
//=============================================================================
#ifndef _PAUSE_H_
#define _PAUSE_H_

#include "main.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define NUM_CHOICE (3)	//選択肢の数

//*****************************************************************************
// 前方宣言
//*****************************************************************************
class CScene2D;

//*****************************************************************************
// ポーズクラス
//*****************************************************************************
class CPause
{
public:
	CPause();	//デフォルトコンストラクタ
	~CPause();	//デストラクタ
	HRESULT Init(void);	//初期化処理
	void Uninit(void);	//終了処理
	void Update(void);	//更新処理
	void SetPause(bool bPause);	//ポーズ状態の設定
	bool GetPause(void);		//ポーズ状態の取得

private:
	CScene2D* m_pPauseBg;				//背景ポリゴン
	CScene2D* m_apChoice[NUM_CHOICE];	//選択肢ポリゴン
	bool m_bPause;	//ポーズの状態
	int m_nChoice;	//現在の選択肢
	bool m_bLockInput;	//入力処理をロック

};

#endif // !_PAUSE_H_